mattmc3/ez-compinit

ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/asdf
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/python

zdharma-continuum/fast-syntax-highlighting kind:defer
jeffreytse/zsh-vi-mode
zsh-users/zsh-autosuggestions
junegunn/fzf-git.sh
