# set up Zsh completions with plugins
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/podman
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/zoxide
ohmyzsh/ohmyzsh path:plugins/eza
ohmyzsh/ohmyzsh path:plugins/mise

jeffreytse/zsh-vi-mode
olets/zsh-abbr kind:defer
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
junegunn/fzf-git.sh
bigH/git-fuzzy path:bin kind:path
zdharma-continuum/fast-syntax-highlighting kind:defer
romkatv/powerlevel10k
